In [ ]:
============ ========  EDA  ========================
1)  pandas  : Dataframe or data applications
2)  numpy   : Numerical python for math operations
3)  matplotlib: For plots graphs
4)  Seaborn  : For plots graphs
5)  Bokhe    : For plots
6)  plotly   : For plots
    
===========================   Machine Learning  ===========
7)  Scilit learn(sklearn)  :  ML models
8)  stats                  :  statistical models
    
    
==============================  Data retrival from SQL scrapping ==============
9)  sqlite      : connect with database
10)  Beautiful soup  :scrap the data from website
11)  websocket      :scrap
    
============================== Deep Learning /Computer Vision ======================
12)Tensor flow   :  developed by Google
13) Keras        :  DL models
14)  Open CV     , CV2
15) Pillow(PIL)  : Image Operations
16)  Pytorch     :
      VGG16
      Mobilenet
      RESNET
      RCNN
      MASKRCNN
      FASTERNCNN
      YOLO 
        
==================================   NLP   ======================
18)   NLTK  :natural language process
19)   Scipy :
20)   Word2vec  (How words will convert into vector)  : 
21)   GloVE   
22)  Wordcloud

============ Hugging face  =========
BERT models 
23)  Transformers  :BERT  (Bidirectional Encoded Representations from Transformers)
    
============= GENAI  Models  ===========

24) OpenAI +Microsoft  :GPT Models
25) Google :  Gemini
26) Amazon :  Q
27) Meta Facebook  :
28) Apple 



LLAMA
GEMMA
Dalle-E
T5
    All are having different different PACKAGES
    
=========================  LANGCHAIN  ================

29)  LangChain (Framework)


=========================   Deployments ===================
30) Flask 
31) Streamlit
32) Django

======================    MLops ==================

33) Mlflow
34) Kubeflow
35) Azure AI Services :Azure packages
36) GCP : GCP packages

In [1]:
a=10
b=20
c=a+b
print(c)

30

step-1  Create dataframe

 We will create a dataframe using list.
                   We will create a dataframe using dictionary

In [ ]:
import pandas as pd

In [6]:
import pandas as pd
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [7]:
type(d1)

pandas.core.frame.DataFrame

# Step-2
Provide the data

In [10]:
names = ['swathi','ashok','pavan']
pd.DataFrame(names)

        0
0  swathi
1   ashok
2   pavan

In [11]:
names = ['swathi','ashok','pavan']
age = [24,28,22]
pd.DataFrame(names,age)

         0
24  swathi
28   ashok
22   pavan

In [12]:
names = ['swathi','ashok','pavan']
age = [24,28,22]
pd.DataFrame(zip(names,age))

        0   1
0  swathi  24
1   ashok  28
2   pavan  22

In [13]:
names = ['swathi','ashok','pavan']
age = [24,28,22]
city =[ 'hyd','bgl','vij']
pd.DataFrame(zip(names,age,city))

        0   1    2
0  swathi  24  hyd
1   ashok  28  bgl
2   pavan  22  vij

# step-3
Provide the column names

In [16]:
pd.DataFrame(names,columns=['Names'])

    Names
0  swathi
1   ashok
2   pavan

In [23]:
names = ['swathi','ashok','pavan']
age = [24,28,22]
city =[ 'hyd','bgl','vij']
pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])

    Names  Age City
0  swathi   24  hyd
1   ashok   28  bgl
2   pavan   22  vij


# step-4
Providing Index

In [25]:
names = ['swathi','ashok','pavan']
age = [24,28,22]
city =[ 'hyd','bgl','vij']
pd.DataFrame(zip(names,age,city),index=['1','2','3'],columns=['Names','Age','City'])

    Names  Age City
1  swathi   24  hyd
2   ashok   28  bgl
3   pavan   22  vij

In [29]:
names = ['swathi','ashok','pavan']
age = [24,28,22]
city =[ 'hyd','bgl','vij']
pd.DataFrame(zip(names,age),columns=['Names','Age'],index=city)

      Names  Age
hyd  swathi   24
bgl   ashok   28
vij   pavan   22

 create a dataframe

provide the data

add the columns

provide the column names

provide the index

Step-5

Add a new column on existing data frame

In [2]:
# Create a dataframe
# Name
# age 
# city

import pandas as pd
names=['swathi','ashok','pavan']
age=[24,28,23]
city=['Hyd','bgl','vij']
pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'],index=city)

      Names  Age City
Hyd  swathi   24  Hyd
bgl   ashok   28  bgl
vij   pavan   23  vij

If you want to add a new column

First check how many rows are there

For example in above dataframe we have 3 rows

your new column also should have 3 rows

suppose I want to create a new column: salary

make a list with 3 values

salary=[100000,200000,300000]

syntax: dataframe[column]=list of values

salary=[100000,200000,300000]

df['salary']=salary`

In [5]:
import pandas as pd
names=['swathi','ashok','pavan']
age=[24,28,23]
city=['Hyd','bgl','vij']
df=pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])
salary=[10000,20000,30000]
df['Salary']=salary
df

    Names  Age City  Salary
0  swathi   24  Hyd   10000
1   ashok   28  bgl   20000
2   pavan   23  vij   30000

use case-1

Create empty data frame first

Create 3 list using list comprehension

list1= a values from 1 to 10

list2= square of 1 to 10

list3= cube of 1 to 10

Finally make a dataframe

In [25]:
import pandas as pd
df1=pd.DataFrame()
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['Num']=l1
df1['Squares']=l2
df1['Cubes']=l3
df1

   Num  Squares  Cubes
0    1        1      1
1    2        4      8
2    3        9     27
3    4       16     64
4    5       25    125
5    6       36    216
6    7       49    343
7    8       64    512
8    9       81    729

Step-6

Update the already existed column

Create a new column

createing a new list salary=[1000,2000,3000]

df['S']

Creating a new column the column name is our choice

update existing coumn are same way only

Here also we need a make a list of values = number of rows

while updating the existing column

we need to provide already existed column name only

df['Z']= list of values

In [24]:
# dataframe name: df1
# list of values variable name: z
# which column we want to update : Z'
z=[i**4 for i in range(1,10)]
df1['Power 4']=z
df1

   Squares  Cubes  Power 4
0        1      1        1
1        4      8       16
2        9     27       81
3       16     64      256
4       25    125      625
5       36    216     1296
6       49    343     2401
7       64    512     4096
8       81    729     6561

Step-7

Drop the column

In [6]:
# How to check the columns
df1.columns

Index(['Num', 'Squares', 'Cubes', 'Power 4'], dtype='object')

 If you want to drop a specific column

we will use drop method

we already know about difference between keywords and methods

Keywords will use directly

Methods will use with corresponding dataframe

Method name: drop

 df1.drop()

Column: which column you want to drop

axis: Represents the specified value is a row or column

axis= 0 means rows

axis=1 means column

by default axis=0

inplace: will provide overwrite the dataframe or not

inplace= True , this indicates overwrite the dataframe

inplace=False, this indicates the modified dataframe will be use when you provide new variable for the operation

[ ]

In [7]:
df1.drop('X')  
# we are not providing axis
# it assuming the provided value is  a row
# by default axis=0  ==== rows

KeyError: "['X'] not found in axis"

In [14]:
df1.drop('Num',axis=1)

# after this in a new cell type df1
# you will see original dataframe
# because we did not provide inplace

# If you want to use below output
# you need to assign a variable
#df_new=df1.drop('X',axis=1)

   Squares  Cubes  Power 4
0        1      1        1
1        4      8       16
2        9     27       81
3       16     64      256
4       25    125      625
5       36    216     1296
6       49    343     2401
7       64    512     4096
8       81    729     6561

In [8]:
df1.drop('Num',axis=1,inplace=True)
df1

   Squares  Cubes  Power 4
0        1      1        1
1        4      8       16
2        9     27       81
3       16     64      256
4       25    125      625
5       36    216     1296
6       49    343     2401
7       64    512     4096
8       81    729     6561

In [9]:
df1.drop('Number')
# if we run this we get error
# by default axis=0 which represents about rows
# But  'Number' is a column

KeyError: "['Number'] not found in axis"

In [11]:
df1.drop(7)# if we want drop  row then provide row index

   Squares  Cubes  Power 4
0        1      1        1
1        4      8       16
2        9     27       81
3       16     64      256
4       25    125      625
5       36    216     1296
6       49    343     2401
8       81    729     6561

In [13]:
df1.drop([3,6])
# Multiple column always keep in a list.

   Squares  Cubes  Power 4
0        1      1        1
1        4      8       16
2        9     27       81
4       25    125      625
5       36    216     1296
7       64    512     4096
8       81    729     6561

In [14]:
df1

   Squares  Cubes  Power 4
0        1      1        1
1        4      8       16
2        9     27       81
3       16     64      256
4       25    125      625
5       36    216     1296
6       49    343     2401
7       64    512     4096
8       81    729     6561

In [20]:
df1.drop([0,1],axis=1)
# [0,1]  index
# axis=1 columns
# error

KeyError: '[0, 1] not found in axis'

step-9


How to Select the Coloumn

In [26]:
df1['Num']
# Series type
# No Column name directly
# whenever you see this type:series type

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Num, dtype: int64

In [32]:
df1[['Squares']]
# when ever u see coloumn that is dataframe
# double square brackets means

   Squares
0        1
1        4
2        9
3       16
4       25
5       36
6       49
7       64
8       81

In [28]:
type(df1['Num'])

pandas.core.series.Series

In [29]:
type(df1[['Num']])

pandas.core.frame.DataFrame

In [33]:
df1.Num

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Num, dtype: int64

In [ ]:
~ df1['Num']   :  series type
~ df1[['Num']] :  Dataframe type
~ df1.Num      :  Series type

In [37]:
cols=['Num','Squares']
df1[cols]

   Num  Squares
0    1        1
1    2        4
2    3        9
3    4       16
4    5       25
5    6       36
6    7       49
7    8       64
8    9       81

In [40]:
cols=['Cubes','Power4']
df1[cols]

KeyError: "['Power4'] not in index"

In [41]:
df1['Squares'].values

array([ 1,  4,  9, 16, 25, 36, 49, 64, 81], dtype=int64)

In [ ]:
~  All values comes in an array
~ Array means it is a list of elements only represents using numpy package
~ Generally elements present in 3 ways:
            ****  LIST:  Basic representations
            ****  NUMPY ARRAY:   Array with Numpy package
            ****  TENSORS:   Tensorflow package
            ****  TORCH:   Pytorch package

In [42]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [43]:
import numpy as np
np.array(list1)  # this is numpy package 
#   numpy==array==list

array([1, 2, 3, 4])

In [46]:
list1=[1,2,3,4]
list2=[5,6,7,8]
list1+list2

[1, 2, 3, 4, 5, 6, 7, 8]

In [48]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([ 6,  8, 10, 12])

In [49]:
df1['Num'].values
# Imagine we worked on an ML problem
# We got some series of values
# With that series of values also we can create a dataframe

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [50]:
df1

   Num  Squares  Cubes
0    1        1      1
1    2        4      8
2    3        9     27
3    4       16     64
4    5       25    125
5    6       36    216
6    7       49    343
7    8       64    512
8    9       81    729

STEP_10
 
 
 How to SAVE the DataFrame

In [ ]:
*** Data frames we can save in two formats
        ~  csv  : comma  seperated value
        ~  xlsx: excel format
    ** In order to save any data
       ~ where you want to save:  directory name
       ~  what is the name of the file for storing
       ~  what is the extention
    *** we already seen in file handling session

In [53]:
# dataframe:  df1
# CASE-1 :  saving file at same location
# No need to provide directory path
# Directory give only name of the file
# and extension
df1.to_csv('Data1.csv')
df1.to_excel('Data1.xlsx')

 STEP-12

How to READ a Dataframe

In [55]:
pd.read_csv('Data1.csv')

   Unnamed: 0  Num  Squares  Cubes
0           0    1        1      1
1           1    2        4      8
2           2    3        9     27
3           3    4       16     64
4           4    5       25    125
5           5    6       36    216
6           6    7       49    343
7           7    8       64    512
8           8    9       81    729

In [57]:
pd.read_excel('Data1.xlsx')

   Unnamed: 0  Num  Squares  Cubes
0           0    1        1      1
1           1    2        4      8
2           2    3        9     27
3           3    4       16     64
4           4    5       25    125
5           5    6       36    216
6           6    7       49    343
7           7    8       64    512
8           8    9       81    729

In [ ]:
** extra unnamed is coming in excel, csv files

 STEP-13

How to AVOID index column

In [ ]:
** while we save the datarame
** automatically  a new column will create
** that we need toavoid
**  Permission denied means close the data file from laptop

In [62]:
df1.to_csv('Data1.csv',index=False)
df1.to_excel('Data1.xlsx',index=False)

In [63]:
pd.read_csv('Data1.csv')

   Num  Squares  Cubes
0    1        1      1
1    2        4      8
2    3        9     27
3    4       16     64
4    5       25    125
5    6       36    216
6    7       49    343
7    8       64    512
8    9       81    729

In [66]:
pd.read_excel('Data1.xlsx')

   Num  Squares  Cubes
0    1        1      1
1    2        4      8
2    3        9     27
3    4       16     64
4    5       25    125
5    6       36    216
6    7       49    343
7    8       64    512
8    9       81    729